In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(data={"A":[1,1,1,2,3,4]})
df

   A
0  1
1  1
2  1
3  2
4  3
5  4

### Unique values

- nunique - count of unique vales
- value_counts - appearance of each values how many time

In [3]:
# count of unique values
df["A"].nunique()

4

In [4]:
df["A"].value_counts()

1    3
4    1
3    1
2    1
Name: A, dtype: int64

In [5]:
df["A"].value_counts().index

Int64Index([1, 4, 3, 2], dtype='int64')

### Merge

 - on
 - how: left, right, inner, outer, cross
 
### Join
 - allows only to join on the basis onindex where as merge allows join on columns and indexes

In [6]:
# merge
df1 = pd.DataFrame(data={"Id": [1,2,3], "Name": ["Akash1", "Akash2", "Akash3"]})
df2 = pd.DataFrame(data={"Id": [1,2], "Address": ["add1", "add2"]})
dfMerge = pd.merge(df1, df2, on="Id", how="right") # left, right, inner, outer, cross
dfMerge

   Id    Name Address
0   1  Akash1    add1
1   2  Akash2    add2

In [7]:
df3 = pd.DataFrame(data={"Name": ["Akash", "Akash", "Akash", "Sumit", "Sumit", "Vatsal"],
                         "Subject": ["Maths", "Physics", "English", "Maths", "Physics", "English"],
                         "Marks": [80,50, 70, 20, 30,20]
                        })
df3

     Name  Subject  Marks
0   Akash    Maths     80
1   Akash  Physics     50
2   Akash  English     70
3   Sumit    Maths     20
4   Sumit  Physics     30
5  Vatsal  English     20

## Group by
#### column creation - 
- constant
- using other columns

In [8]:
df3.groupby("Subject").sum()

         Marks
Subject
English     90
Maths      100
Physics     80

In [9]:
df3["TotalMarks"] = 100
df3

     Name  Subject  Marks  TotalMarks
0   Akash    Maths     80         100
1   Akash  Physics     50         100
2   Akash  English     70         100
3   Sumit    Maths     20         100
4   Sumit  Physics     30         100
5  Vatsal  English     20         100

In [36]:
import numpy as np
df3.groupby(["Name", "Subject"]).agg({"Marks": sum, "TotalMarks": np.average})

                Marks  TotalMarks
Name   Subject
Akash  English     70         100
       Maths       80         100
       Physics     50         100
Sumit  Maths       20         100
       Physics     30         100
Vatsal English     20         100

In [10]:
df4 = df3.groupby("Name").sum()
df4

        Marks  TotalMarks
Name
Akash     200         300
Sumit      50         200
Vatsal     20         100

In [11]:
df4["percentage"] = df4["Marks"] / df4["TotalMarks"]
df4

        Marks  TotalMarks  percentage
Name
Akash     200         300    0.666667
Sumit      50         200    0.250000
Vatsal     20         100    0.200000

### Drop / sort / empty

In [12]:
df4.empty

False

In [13]:
df4.drop(["percentage"], axis=1)

        Marks  TotalMarks
Name
Akash     200         300
Sumit      50         200
Vatsal     20         100

In [14]:
df4.sort_values("Marks", inplace=True, ascending=True)
df4

        Marks  TotalMarks  percentage
Name
Vatsal     20         100    0.200000
Sumit      50         200    0.250000
Akash     200         300    0.666667

In [17]:
dfstrip = pd.DataFrame(data={"Akash": ["1 ","2aa ","3   ","  4  "]})
dfstrip

   Akash
0     1
1   2aa
2   3
3    4

In [18]:
dfstrip["Akash"].str.strip()

0      1
1    2aa
2      3
3      4
Name: Akash, dtype: object

### Filter

In [44]:
dffilter = pd.DataFrame(data={"Id": [1,2,3,4,5,5,6,7,8,10,9], "People": [123,213,4564,678,546,4564,567,234,23,42,34]})

dffilter.query("Id>7")

    Id  People
8    8      23
9   10      42
10   9      34

In [26]:
dffilter[dffilter["Id"]>7]

    Id
8    8
9   10
10   9

In [38]:
dffilter[(dffilter["Id"]==5) | (dffilter["Id"]==1)]  # or condition

   Id
0   1
4   5
5   5

### Apply

- axis = 0: column
- axis = 1: row

In [49]:
dffilter.apply(np.sum, axis=0)

Id           60
People    11588
dtype: int64

In [50]:
dffilter.apply(np.sum, axis=1)

0      124
1      215
2     4567
3      682
4      551
5     4569
6      573
7      241
8       31
9       52
10      43
dtype: int64

In [52]:
dffilter.applymap(lambda x: x**2)

     Id    People
0     1     15129
1     4     45369
2     9  20830096
3    16    459684
4    25    298116
5    25  20830096
6    36    321489
7    49     54756
8    64       529
9   100      1764
10   81      1156

In [121]:
dffilter['Id'] = dffilter['Id'].apply(lambda x: x + 1)
dffilter

    Id  People
0    4     123
1    5     213
2    6    4564
3    7     678
4    8     546
5    8    4564
6    9     567
7   10     234
8   11      23
9   13      42
10  12      34

In [108]:
def is_even(x):
    return x%2==0

# convert to vectorised numpy method
is_even_vectorized = np.vectorize(is_even)

# apply method
p = is_even_vectorized(dffilter["Id"])
print(p)

# get only those rows where value is true
dffilter.iloc[p]

# dffilter.loc[dffilter.filter(is_even(dffilter["Id"]))]

[False  True False  True False False  True False  True  True False]

   Id  People
1   4     213
3   6     678
6   8     567
8  10      23
9  12      42

### loc, iloc
The main distinction between the two methods is:

loc gets rows (and/or columns) with particular labels.

iloc gets rows (and/or columns) at integer locations.

To demonstrate, consider a series s of characters with a non-monotonic integer index:

s = pd.Series(list("abcdef"), index=[49, 48, 47, 0, 1, 2]) 
49    a
48    b
47    c
0     d
1     e
2     f

s.loc[0]    # value at index label 0
'd'

s.iloc[0]   # value at index location 0
'a'

s.loc[0:1]  # rows at index labels between 0 and 1 (inclusive)
0    d
1    e

s.iloc[0:1] # rows at index location between 0 and 1 (exclusive)
49    a

In [56]:
dffilter.loc[dffilter["People"]> 500, ["Id"]] # filter on column people get column id

   Id
2   3
3   4
4   5
5   5
6   6

In [69]:
dfloc = pd.DataFrame([[1, 2], [4, 5], [7, 8]],index=['cobra', 'viper', 'sidewinder'], columns=['max_speed', 'shield'])
dfloc

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [81]:
dfloc["max_speed"]

cobra         1
viper         4
sidewinder    7
Name: max_speed, dtype: int64

In [74]:
dfloc[["max_speed"]]

            max_speed
cobra               1
viper               4
sidewinder          7

In [75]:
dffilter.iloc[0]

Id          1
People    123
Name: 0, dtype: int64

In [76]:
dffilter.iloc[0:5]

   Id  People
0   1     123
1   2     213
2   3    4564
3   4     678
4   5     546

In [115]:
dffilter.iloc[lambda x: x.index % 2 == 0]

    Id  People
0    3     123
2    5    4564
4    7     546
6    8     567
8   10      23
10  11      34

In [117]:
"""

Filtering based on column

def is_even(x):
    return x%2==0

# convert to vectorised numpy method
is_even_vectorized = np.vectorize(is_even)

# apply method
p = is_even_vectorized(dffilter["Id"])
print(p)

# get only those rows where value is true
dffilter.iloc[p]
"""

'\n\nFiltering based on column\n\ndef is_even(x):\n    return x%2==0\n\n# convert to vectorised numpy method\nis_even_vectorized = np.vectorize(is_even)\n\n# apply method\np = is_even_vectorized(dffilter["Id"])\nprint(p)\n\n# get only those rows where value is true\ndffilter.iloc[p]\n\n# dffilter.loc[dffilter.filter(is_even(dffilter["Id"]))]\n'

In [85]:
dffilter.iloc[0, 1]  # 0 row 1st column

123

In [119]:
dffilter.iloc[0:5, 1] # 0-4 row and 1st column

0     123
1     213
2    4564
3     678
4     546
Name: People, dtype: int64

In [124]:
ap = np.array(["a", "k", "a", "s", "h"])
ser = pd.Series(ap, index=["10", "11", "12", "13", "14"])
ser

10    a
11    k
12    a
13    s
14    h
dtype: object

In [125]:
my_dict = {'a': 1, 'b':2, 'c': 3}
ser1 = pd.Series(my_dict)
ser1

a    1
b    2
c    3
dtype: int64

In [130]:
df_series = pd.DataFrame({"one": pd.Series(["1","2","3"]), "two": pd.Series(["4","4","6"])}, index=[1,1,2,3])
df_series

   one  two
1    2    4
1    2    4
2    3    6
3  NaN  NaN

In [137]:
df_series.loc[:2]

  one two
1   2   4
1   2   4
2   3   6

In [142]:
for index, row in df_series.iterrows():
    print(index,row["one"], row["two"])

1 2 4
1 2 4
2 3 6
3 nan nan

###  fillna vs interpolate
- fillna: allows to fill static values
- interpolate: allows to interpolate based on linear, time etc

In [143]:
df_series.fillna(1, inplace=True)

In [144]:
df_series

  one two
1   2   4
1   2   4
2   3   6
3   1   1

In [146]:
 # insert row at bottom
df_series.loc[len(df_series.index)] = [8, 8]
df_series

  one two
1   2   4
1   2   4
2   3   6
3   1   1
4   8   8
5   8   8

In [149]:
df_series["three"] = [1,2,3,4,5,6,]
df_series

  one two  three
1   2   4      1
1   2   4      2
2   3   6      3
3   1   1      4
4   8   8      5
5   8   8      6

### percentile quantile

In [152]:
df_series.three.quantile(0.9)  # 90th percentile

5.5

In [154]:
# change column datatype
df_series["one"] = df_series["one"].apply(pd.to_numeric)
df_series

   one two  three
1    2   4      1
1    2   4      2
2    3   6      3
3    1   1      4
4    8   8      5
5    8   8      6

In [155]:
df_series.astype({"one": int})

   one two  three
1    2   4      1
1    2   4      2
2    3   6      3
3    1   1      4
4    8   8      5
5    8   8      6

In [156]:
df_series.drop([5], inplace=True)
df_series

   one two  three
1    2   4      1
1    2   4      2
2    3   6      3
3    1   1      4
4    8   8      5

In [158]:
df_series.drop(["three"], axis=1, inplace=True)
df_series

   one two
1    2   4
1    2   4
2    3   6
3    1   1
4    8   8